export const article1 = `# はじめに

あなたはアウトプットしていますか？

アウトプットしている人はどれくらいの頻度でアウトプットしていますか？どれくらいの量でアウトプットしていますか？
おそらく多くの人が「**そもそもあんまりアウトプットしてないよ...**」状態なのではないでしょうか？
もしくは、「**昔はアウトプットしてたけど、最近はアウトプットしていないな...**」という人もいたりするのではないでしょうか？

この記事では、アウトプットをしてみてよかったことをまとめて、「**アウトプットしてみようよ！**」ってことを伝えたいと思います。
決して怪しい売り込みではないので、「**ほぇ〜**」と思いながらみていただけると嬉しいです✨

# プロフィール

「**まずお前はアウトプットしているのか？**」
こんなことを言われかねないので、まずは簡単に僕自身のアウトプット履歴をご紹介します。
僕自身は2020年からプログラミングの学習をしはじめ、その年から記事を書いてきました。
以下のブログやQiitaの昔の記事を見てもらえればわかるはずです。

https://chaldene.net/

https://qiita.com/cardene

最近では2023年7月の1ヶ月で35記事書きました。

https://twitter.com/cardene777/status/1685929952649375744

そのおかげでQiitaの週間ユーザーランキングで2位に入ることができました。

https://twitter.com/cardene777/status/1687281070516158464

このように少なくとも、「**まあ、ちゃんと書いてはいるんだな。話くらいは聞いてやるよ。**」程度には記事を書いてきています。
ぜひ「**どしたん？話聞こか？**」のテンションで読んで頂ければと思います。

# アウトプットのメリット

この章ではアウトプットのメリットをつらつらと並べてみようと思います。

## 学んだことの定着

これはよく聞くことですね。
何かを学んだ、いわゆるインプットをしただけでは自分の中に定着はしづらいです。
そこでアウトプットが役に立ってきます。
インプットしたことを記事にまとめたり、何か実際に作ったりすることで頭の中の整理ができたり、自分が何を理解して何を理解していないかを知ることにつながります。
インプットだけの場合、「**理解しただけ**」という恐ろしい状態になりかねません。
少しつつくと総崩れするハリボテのような状態です...。
急がば回れという言葉があるように、どんどんインプットしていくのではなく以下のようなサイクルを回しましょう。

1. インプットする。
2. インプットしたことを記事などにまとめてアウトプット。
3. アウトプットする中で疑問に思ったことを再度調べる。
4. 新しいことを学び始める。
5. 「**1**」に戻る。

## 新しいことを学びたくなる

頻繁にアウトプットをして、アウトプットをする癖をつけると何かをアウトプットしていないと落ち着かなくなります。
そうです。
まさに禁断症状が出るのです。
しかも、悪い禁断症状ではなく良い禁断症状です（良い禁断症状とは？）。
この禁断症状が出ると、アウトプットせずにはいられない体になります。
「**な、何かアウトプットしなくては...**」
、と常にアウトプットする題材を求め始めます。

![image.png](https://qiita-image-store.s3.ap-northeast-1.amazonaws.com/0/570269/5a7faf88-d2b5-a15d-2e10-499b30def075.png)

この症状が出た方はいやでもアウトプットするため、自然と成長していきます。
ここで勉強をしないエンジニアとどんどん差をつけられるようになります。
苦もせず勉強ができるというのは素晴らしいものです。
よくアウトプットしたり、何かを学んだりしていると「**勉強してて偉いですね！**」と言われるのですが、この言葉には個人的に違和感しかありません。
なぜなら、「**ゲーム好きな人がひたすらゲームをしている**」のと同じ感覚だからです。
そうです。趣味を謳歌して楽しんでいるだけなのです。
なので、ぜひみなさんはゲームをしている人にも「**ずっとゲームしてるの偉いですね！**」や「**ずっとゲームしてるの凄いですね！**」と言ってあげてください。
嫌味にならないようにだけ気をつけてください（でも素直に何時間もゲームできる人すごい）。

## 承認欲求

アウトプットをしていると、記事自体を褒められたり、アウトプットをしていることを褒められたり、書いた記事にいいねがたくさんついたりと承認欲求が刺激されます。
人間誰しも承認されたいという欲求を少なからず持っていて、褒められれば嬉しくなるものです。
もし褒められるのが苦手な人でも、記事などのアウトプットであれば直接褒められるわけではないため、比較的褒められて問題ない状況なのではないでしょうか？

承認欲求が刺激されると不思議なもので、より褒められたくなるものです。
「**もっともっと僕を褒めて！！！**」
、とこれも一種の禁断症状のように賞賛を求め続けるようになります。
でも、これが自分の成長につながるのであれば良い承認欲求なのではないでしょうか（承認欲求に良い、悪いあるのかわからないですが...）？
ガンガン承認欲求高めていきましょう！

## 認知される

たくさんアウトプットしていると、自分が知らないところで記事が共有されたり、自分の記事を見たことがある人が増えます。
そうすると、
「**あ！〇〇さんですよね！アウトプットすごいですね！**」
など、自分のことを知ってくれる人が増えます。
これは記事を単に書くだけではダメで、多少なりともいいねがついたり、TwitterなどのSNSで共有して他の人の目に触れる機会を増やしておく必要があります。
認知されると何が良いかというと、そうです、承認欲求が満たされます。
もう承認欲求の鬼とかしています。
「**いろんなところで認知されてるの最高！**」
こんな気持ちになること間違いなしです。
冗談はさておき（冗談ではないですが）、認知されることで人との繋がりは増えるようになります。
次の章の「**アウトプットの効用**」でも書いているのですが、人とのつながりが増えるとそこから何かお願いされたり、何かを一緒にしたりと機会に恵まれるようになります。
他の人に認知されてどんどんつながり増やして成長するという好循環が回せるようになります。



# アウトプットの効用

この章では、実際にアウトプットすることで得られたことを、自分の事例を用いてまとめていきます！

## コラボ

例えばあるサービスについてアウトプットしたり、特定の分野についてアウトプットしていると、
「**一緒に何か作りましょう！**」や「**一緒に何かやりませんか？**」などの連絡が来ることがあります。
これはめちゃくちゃ貴重な機会です。
特にポイントとなるのが「**相手から提案される**」ことです。
受けるかどうかを選べるとかではなく、相手は乗り気なので高い確率で一緒に何かできます。
これは間違いなく自分の成長や経験になってプラスになること間違いなしです。
ただ、中には変なのも混じっていると思うので気をつけてください。

## 社内でのポジション確立

ガンガンアウトプットしていると、特に社内で知られるようになり「**アウトプットする人**」というポジションを確立できます。
今まで「**ただのエンジニア**」だった状態から、肩書付きのエンジニアになれるのは大きいです。
目立ちたくないという気持ちもわからないでもないですが、肩書きがつくことで一目置かれるような存在になれます。
その結果、先輩や上司にも褒められることがあるかもしれません（承認欲求の再登場）。
アウトプットしているだけでそのポジション取れるのであれば、だいぶコスパ良くないですか？
会社で働くのであれば、替えのきくエンジニアではなく替えの効かないようなエンジニアを目指したくなるものです（自論ですが）。
実際に自分も社内では、「**アウトプットする人**」というポジションを確立して「**アウトプットしましょう！**」などとうるさく叫びまくってます（うざがられていないか心配...）。

## 記事が前より伸びる

これはアウトプットして、トレンドなどに自分の記事が載るようになってからのことですが、自分の記事が認知される機会が増えると自然と前よりもいいねの数が増えたりします。
やはり認知というものは大切で、「**知られていないと、良い記事でもいいねがつかない**」ということになります。
いくら良い記事でも知られていないと埋もれてしまうのが世の常です。
逆に多少なりとも有益な記事で、それが認知されるようになると自然と以前よりもいいねされる機会が増えるようになります。
まさに雪だるまのように、どんどん転がっていってくれます。
ただ、これは一過性なことも考えれるため怠けずに継続してアウトプットする必要があります。
だんだんどんな記事が好まれるのかなどもわかるようになってくるので、色々実験してみても良いかもしれません。
大切なのは「**足を止めない**」ことです。
アウトプットの頻度は減らしても、立ち止まらず前に進み続けましょう。

# 最後に

今回は「**アウトプットはいいぞ！**」というタイトルで、アウトプットの魅力を全力で伝えてきました。
いかがだったでしょうか？
「**アウトプットしてみたいです！**」というような気持ちになってくれていたら嬉しいです。

Twitterやっているので何かあればDMください！

[Twitter @cardene777](https://twitter.com/cardene777)
`


export const article2 = `
# はじめに

Aくん：「いや〜記事書いたり、何か作ったりアウトプットしてる人たち凄いわ〜」
Bくん：「それな？よくアウトプットできるよね！」
わい：「AくんもBくんもアウトプットしたらいいじゃん？しないの？」
Aくん：「いや〜まだできなさそう！もうちょっと勉強してからにする！」
Bくん：「今ちょっといろいろ忙しくて、来月は落ち着きそうだからその時にアウトプットしようかな！」
わい：「**今すぐアウトプットすればいいのに...**」

こんな感じでアウトプットすることにハードルを感じたり、後回しににしている人は多いのではないでしょうか？
Qiitaやそれこそこの記事を読んでいる人たちはそんなことはなくても、周りを見てみるとどうでしょうか？
この記事ではアウトプットを推奨しつつ、「**もっと気軽にアウトプットしていこう！**」というメッセージを込めてあなたにお届けします。

# プロフィール

「**そんなことを言うお前自身はアウトプットしてるのか？？**」
こんなことを言われかねないので、まずは簡単に僕自身のアウトプット履歴をご紹介します。
僕自身は2020年からプログラミングの学習をしはじめ、その年から記事を書いてきました。
以下のブログやQiitaの昔の記事を見てもらえればわかるはずです。

https://chaldene.net/

https://qiita.com/cardene

最近では2023年7月の1ヶ月で35記事書きました。

https://twitter.com/cardene777/status/1685929952649375744

そのおかげでQiitaの週間ユーザーランキングで1位になることができました。

https://twitter.com/cardene777/status/1688326945258504194?s=46&t=bPkrof0jz5BSqK8XVRZhNg

このように少なくとも、「**まあ、ちゃんと書いてはいるんだな。話くらいは聞いてやるよ。**」程度には記事を書いてきています。

多少ならとも説得力がでると信じて、記事を書き進めていきます。

# アウトプットはいいぞ

アウトプットのメリットは以下の記事でまとめているので、ご興味ある方はぜひ！

https://qiita.com/cardene/items/9ef76cecc372351cc291

# アウトプットのハードル

プログラミングを学習し始めの人ほど、アウトプットに対して高いハードルを感じています。
では、一体このハードルの正体はなんなのでしょうか？
どうしてアウトプットにハードルを感じてしまうのでしょうか？
謎に迫るため、エンジニアワールドの初学者村の奥へと歩みを進めていった（言ってみたかっただけ）。

## めんどくさい

結果、これに尽きると思います。
インプットはしたものの、アウトプットするとなると急激にめんどくささを感じるものです。
その理由としては、アウトプットするにはインプットしたことに対してちゃんとした理解が必要になります。
だから「**めんどくさい**」のです。
その分、「**めんどくさい**」を超えた先に自分の成長が待っていると言えます。
なんでもそうですが楽な道はありません。
簡単にお金儲けしようとして詐欺に引っかかる人が後を立たないように、人間は楽に何かを得ようとしがちです。
そんな甘い話はなく、地道な努力が結果に結びつくのでコツコツといきましょう。
、と高尚なことを言いつつ、「**めんどくさい**」ことは「**めんどくさい**」ですし気持ちもわかります。
この記事の後半の章では、ハードルを1つ1つ打ち倒していくので楽しみに読み進めてください。

流石に「**めんどくさい**」だけでこの章を終わらせるわけには行きません。
まだ初学者村の入り口に片足を入れた状態です。
もう少し探索してみましょう。

## 書く必要なくない？

これも共感する人は多いのでないでしょうか？
ググると良い記事がたくさん出てくるので、果たして自分が記事を書く必要がどこにあるのかと思ってしまいます。
すでにある記事を書いたところで読んでもらえないだろうし、かと言って何か新しい記事も思いつかない。
毎日記事は増えていっているのだから、自分が書く必要性を感じない。
これは自分も感じていたことなのでよくわかります。

## 書く時間がない

これもよく聞きますし、自分もそんな状況に陥ってました。
業務に追われると書く時間なくなりますよね。
「**この業務が終わったら…**」と先延ばしにしたものの、永遠に終わらず永遠に先延ばしになる現象…。
ぜひ名前をつけてもらいたいものです。
「**終わらない先延ばし**」は英語で「**endless procrastination**」というので、「**エンクラ**」と名付けましょう。
Aくん: 「最近業務が忙しくてアウトプット全然できないんだよね…」
Bくん: 「それは**エンクラ**コースだよ！」
ぜひ使ってみてください。

## 途中で挫折

記事を書こうと思い、書き進めていたとします。
しかし、「**しっかりした記事にしないと！**」というプレッシャーから途中で挫折して記事が完成しないということがあるのではないでしょうか？
もしくは、「**しっかりした記事にしないと！**」というプレッシャーから、そもそも記事を書き始めることができない、なんてことも経験したことある人いるのではないでしょうか？
素晴らしい記事を書かれる方がいる分、記事を書くということは中途半端な出来ではダメで、情報密度高く、文字数も多くしないとというプレッシャーを感じている人は少なくないはずです。
何を隠そう過去の自分もそんな感じでした。

## 怖い世界

やたらと冷たい言葉やマウントをとってくるエンジニアはたくさんいます。
「**どうしてもっと優しく伝えてあげられないのだろう？**」
「**そんな怒ることじゃなくない？**」
何度このようなことを感じて来ただろう。
この冷たさや攻撃を喰らったり見たりしていると、自分も下手に公の場で発言しようものなら隅の隅まで突かればボロボロになってしまうのではないかという恐怖に襲われます。
そう考えると、全世界に公開される記事なんて書けなくなってしまいます。
これも、まさに自分が過去に感じていたことです。
エンジニアとしての歴を重ねていくと、あまり気にしなくなってきますが初学者は特に敏感なので暖かく迎え入れましょう。

いや、もしかしたら日本の働き方の構造・社会の構造がそうさせてしまっているのかもしれません。
日本の闇が生んでしまった「**冷酷ぷんぷんエンジニア**」…。
この記事を読んでいる皆さんは温かい陽だまりのようなエンジニアになってください。

## テーマが思い浮かばない

記事を書くにあたり、何を書けば良いかわからなくなる人は少なくないと思います。
「**一体何をテーマに書けば良いのだろう？**」
「**みんなは記事のテーマをどのように決めているのだろうか？**」
謎は深まるばかりです。
せっかく書くなら面白いテーマで書きたくもなります。
「**自分が学びたいことを記事にすれば良い**」
上記のように言われても次に以下のような疑問が思い浮かびます。

## どうやって書けば良いかわからない

そうです。
書き方がわからないのです。
今まで記事なんて書いたことがないので、どのような構成でどのような中身にしていけば良いのかなんてわからないものです。
他の人の記事を参考にしていてもイマイチピンと来ないため、永遠に悩んでしまいます。

# 気軽にアウトプット

前章では、記事を書くことに対して感じるハードルについてまとめてました。
同じような悩みを抱えている人いるのではないでしょうか？
そんなあなたに「**アウトプットはもっと気軽にできるんだぞ！**」ということをこの章では伝えて行こうと思います。

## 短くても中途半端でも良い

記事は短くてもちゃんと言いたいことがまとまっていれば十分です。
なんでもそうですが、長ければ良いということはありません。
短い記事で知りたいことを知れるのが一番なのです。
なので、気張らず短くても良いのだと気軽に書き進めてみましょう。

また、中途半端な出来でも問題ないです。
完璧な記事なんていくら時間があっても書けません。
どこかしらで妥協しているものです。
そして中途半端にもレベルがあると思いますが、究極その記事で言いたいことを言えていれば公開しちゃって良いと思っています。
エラー解決記事であれば、「**〇〇のようなエラーが出ました。解決方法は〇〇です！**」。
アウトプット啓発系の記事であれば、「**〇〇というメリットがあるから、アウトプットはおすすめです！**」など、気張らずに短くても自分が伝えいたことを伝えることを意識しましょう！

この点を意識するだけで、だいぶアウトプットのハードルは下がると思います。

## 書く時間は作る

これは実体験なのですが、「**書く時間は作られるものではなく、作るもの**」です。
前章の「**書く時間がない**」で述べていたように、業務が忙しすぎて記事を書いている暇がない人はたくさんいると思います。
ですが本当に記事を書く時間ありませんか？
案外プライベートの時間でゲームしたり、テレビ見たり、映画見たりと作ろうと思えば記事を書く時間作れるのではないでしょうか？

:::note warn
もしかしたらプライベートの時間は寝る時間くらいといの人がいるかもしれないので、その人は例外とさせてください。
:::

もちろんアウトプットは無理やりするものではありません。
その人の時間を何に使用するかはその人の自由です。
しかし、記事を書きたいという気持ちがある人は、ぜひ1日の中での隙間時間や空いた時間が必ずあると思うので、ぜひその時間を使って記事を書いてみてください。
受動的に書く時間ができるのを待っていても永遠に来ないため、自分から無理やりにでも作ることをお勧めします。

## 自分の成長のために書く

ネットには大量の記事が転がっています。
わざわざ自分が記事を書く必要を感じない人は多いと思います。
「**すでに存在する記事と同じテーマを扱っても...**」
こんなことを感じている人は、ぜひ自分のためにアウトプットしてみてください！
誰かに読んでもらう記事ではなく、自分が学びたいこと、しっかり理解したいことを記事にまとめましょう。
まさに「**自分の成長のために**」記事を書きましょう。
自分のために書いているうちに意外と他の人の役に立っているなんてこともあるので、まずは入り口を簡単にしましょう。

## とにかく書き進める

最初は記事の書き方も分からなければ、書いても書いても気に入らず書き直すと思います。
それで良いのです。
最初から完璧に書くことはできないので、記事をたくさん書く中で書き方を学んでいきましょう。
「**どんな構成にするのか？**」
「**どのように書けば読みやすいのか？**」
「**読みやすさだけでなく見栄えも良くしたい**」
これらのことについても、記事を書いている中でだんだんとコツが掴めてきます。
今でも自分自身完璧ではないですが、最初に記事を書いたときと比べるとマシになっているはずです。
なので！悩みながらでも良いのでとにかく書き進めましょう！
最初はなんでも不恰好です。
不恰好でも前に進み続けることで良くなっていきます。

# まとめ

この記事で言いたいことを一言でまとめると、
「**とにかく書いてみよう！**」
です。
アウトプットにハードルを感じることはありません。
まずは自分ができる範囲でアウトプットしてみましょう。

# 最後に

今回はアウトプットを推奨しつつ、「**もっと気軽にアウトプットしていこう！**」というメッセージをこの記事を読んでいただいているあなたにお届けしてきました。

いかがだったでしょうか？
少しでも「**記事を書いてみようかな！**」、「**アウトプットしてみたくなってきた！**」と思ってもらえたら嬉しいです。

どんどんアウトプットして、ガンガン成長していきましょう！

ぜひこの記事を読んでアウトプットした人は以下のTwitterなどから連絡ください！
読んでいいねさせていただきます！

[Twitter @cardene777](https://twitter.com/cardene777)

# 追記（2023年8月15日）

組織に紐づけていることについて拡大解釈される方がいましたので、この記事と組織の紐付けを解除しました。
組織に紐付けていた理由としましては、組織の記事一覧を見た際にこの記事も読んでいただけたら良いなという思いでした。
この記事自体過去の自分の経験をもとに書いた記事であるため、特に組織に紐づけておく必要もないため解除しました。

https://qiita.com/organizations/about

![Screenshot 2023-08-15 at 0.19.25.png](https://qiita-image-store.s3.ap-northeast-1.amazonaws.com/0/570269/d345260b-cbc5-b4e7-4028-4f3f59825a6b.png)


# 追記（2023年8月15日）

コメントで厳しい意見をいただいていますが、この記事で伝えたいこととしましては初めに述べているように「**アウトプットもっと気軽にできるよ!**」ということです。
ぜひアウトプット少しでも挑戦したいという方がいましたら、尻込みせずに挑戦してみてください。
`;
